load-tests/g1-128-1000.yml
config:
  target: "https://90qojs7z76.execute-api.us-east-1.amazonaws.com"
  phases:
    - duration: 120
      arrivalRate: 1
      name: "warm-up"

    - duration: 3600
      arrivalCount: 1000
      name: "measurement - exactly 1000 arrivals per hour"

    - duration: 60
      arrivalRate: 1
      name: "cool-down"

  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "G1 128MB 1000 per hour"
    flow:
      - post:
          url: "/g1/order"
          json:
            business_request_id: "br-{{ $uuid }}"
            trace_id: "tr-{{ $uuid }}"
            experiment_id: "EXP-G1-128-1000-R1"