load-tests/g2-128-1000-r1.yml
config:
  target: "https://90qojs7z76.execute-api.us-east-1.amazonaws.com"
  phases:
    - duration: 120
      arrivalRate: 1
      name: "warm-up"

    - duration: 3600
      arrivalCount: 1000
      name: "measurement - exactly 1000 arrivals per hour"

    - duration: 60
      arrivalRate: 1
      name: "cool-down"

  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "G2 128MB 1000 per hour"
    flow:
      - post:
          url: "/g2/order-128"
          json:
            business_request_id: "br-{{ $uuid }}"
            trace_id: "tr-{{ $uuid }}"
            experiment_id: "EXP-G2-128-1000-R1"
            orderId: "order-{{ $uuid }}"
            amount: 199000
            items:
              - productId: "p001"
                quantity: 2
              - productId: "p002"
                quantity: 1